
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-staging/runs/run-JiiJeGTbJyofxk9b

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/22 08:40:55 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/32c0944e3d
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_sqs_default.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-staging-default]
module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_iam.aws_iam_user.app: Refreshing state... [id=cms-staging]
module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...
module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets: Refreshing state... [id=E3JMA6ZTI85JQY]
module.aws_cognito.aws_cognito_user_pool.app: Refreshing state... [id=eu-west-1_D1lSlBOF6]
module.aws_sqs_mailers.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-staging-mailers]
module.aws_s3.aws_s3_bucket.logs: Refreshing state... [id=obduk-cms-staging-logs]
module.aws_iam.aws_iam_user_policy.app_ses: Refreshing state... [id=cms-staging:ses]
module.aws_iam.aws_iam_access_key.app: Refreshing state... [id=AKIAWA2A26HVUWKYZKGS]
module.aws_iam.data.aws_iam_policy_document.sqs: Refreshing state...
module.aws_iam.aws_iam_user_policy.app_sqs: Refreshing state... [id=cms-staging:sqs]
module.aws_cognito.aws_cognito_user_group.admin: Refreshing state... [id=eu-west-1_D1lSlBOF6/admin]
module.aws_iam.data.aws_iam_policy_document.cognito: Refreshing state...
module.aws_cognito.aws_cognito_user_pool_domain.app: Refreshing state... [id=obduk-cms-staging]
module.aws_cognito.aws_cognito_user_pool_client.app: Refreshing state... [id=688dieialpg77jph3hieh43jbl]
module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-staging.herokuapp.com"]: Refreshing state... [id=eu-west-1_D1lSlBOF6/obduk-cms-staging.herokuapp.com]
module.aws_iam.aws_iam_user_policy.app_cognito: Refreshing state... [id=cms-staging:cognito]
module.aws_s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=obduk-cms-staging-logs]
module.aws_s3.aws_s3_bucket.assets: Refreshing state... [id=obduk-cms-staging]
module.aws_s3.data.aws_iam_policy_document.assets: Refreshing state...
module.aws_s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=obduk-cms-staging]
module.aws_iam.data.aws_iam_policy_document.s3: Refreshing state...
module.aws_cloudfront.aws_cloudfront_distribution.assets: Refreshing state... [id=E1STRWN0US69TO]
module.aws_iam.aws_iam_user_policy.app_s3: Refreshing state... [id=cms-staging:s3]
module.aws_s3.aws_s3_bucket_policy.assets: Refreshing state... [id=obduk-cms-staging]
module.heroku.heroku_app.app: Refreshing state... [id=obduk-cms-staging]
module.heroku.heroku_formation.app_worker: Refreshing state... [id=19dfeffa-103c-4861-967c-46d05ea96011]
module.heroku.heroku_addon.app_scout: Refreshing state... [id=be37392e-80d5-42ba-a5a4-c09383e69b99]
module.heroku.heroku_app_feature.app_log_runtime_metrics: Refreshing state... [id=obduk-cms-staging:38237df0-7bf3-4c94-b0a7-bd277029cf2d]
module.heroku.heroku_app_feature.api_runtime_dyno_metadata: Refreshing state... [id=obduk-cms-staging:33146ed7-199e-4a8a-b648-08fd0b52e10d]
module.heroku.heroku_addon.app_scheduler: Refreshing state... [id=c0c8f87c-27e2-4bea-aaf5-0b8e110697e4]
module.heroku.heroku_addon.app_postgresql: Refreshing state... [id=a91439e3-c47f-4557-a5e7-0310d792aeb5]
module.heroku.heroku_addon.app_logentries: Refreshing state... [id=ae2833f5-8eb6-4c6f-bd2e-57c6fb2bdd1f]
module.heroku.heroku_addon.app_librato: Refreshing state... [id=f1eaede8-034c-4ae2-a278-fa2fb53a0dfe]
module.heroku.heroku_formation.app_web: Refreshing state... [id=3c8483c9-5184-4de9-9236-d742641b850e]
module.heroku.heroku_addon.app_rollbar: Refreshing state... [id=b3eb729b-cc76-463b-ba11-ebd113df4c18]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_cloudfront.aws_cloudfront_distribution.assets will be updated in-place
  ~ resource "aws_cloudfront_distribution" "assets" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = []
        arn                            = "arn:aws:cloudfront::414063456747:distribution/E1STRWN0US69TO"
        caller_reference               = "2019-02-24T09:08:16.124237769Z"
      ~ comment                        = "cms-staging" -> "obduk-cms-staging"
        domain_name                    = "d2bbe0c4xum2c2.cloudfront.net"
        enabled                        = true
        etag                           = "E3IW9CO46XK94B"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E1STRWN0US69TO"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-07-21 20:15:16.316 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {
            "environment" = "staging"
            "project"     = "cms"
        }
        wait_for_deployment            = true

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

      ~ logging_config {
            bucket          = "obduk-cms-staging-logs.s3.amazonaws.com"
            include_cookies = false
          ~ prefix          = "AWSLogs/414063456747/cloudfront/cms-staging/" -> "AWSLogs/414063456747/cloudfront/obduk-cms-staging/"
        }

        origin {
            domain_name = "obduk-cms-staging.s3.amazonaws.com"
            origin_id   = "S3"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/E3JMA6ZTI85JQY"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

        viewer_certificate {
            cloudfront_default_certificate = true
            minimum_protocol_version       = "TLSv1"
        }
    }

  # module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "assets" {
        caller_reference                = "2019-02-24T09:08:01.117743479Z"
        cloudfront_access_identity_path = "origin-access-identity/cloudfront/E3JMA6ZTI85JQY"
      ~ comment                         = "cms-staging" -> "obduk-cms-staging"
        etag                            = "E2OXHAZY96X4MZ"
        iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3JMA6ZTI85JQY"
        id                              = "E3JMA6ZTI85JQY"
        s3_canonical_user_id            = "d68b84d7d2f71d7aa58c354d126be5d0be9547a50f1294f1f1f24e9ee0e38ec3d45c357ef52bad188155b3c389023d8a"
    }

  # module.aws_iam.aws_iam_access_key.app must be replaced
-/+ resource "aws_iam_access_key" "app" {
      + encrypted_secret     = (known after apply)
      ~ id                   = "AKIAWA2A26HVUWKYZKGS" -> (known after apply)
      + key_fingerprint      = (known after apply)
      ~ secret               = (sensitive value)
      ~ ses_smtp_password    = (sensitive value)
      ~ ses_smtp_password_v4 = (sensitive value)
      ~ status               = "Active" -> (known after apply)
      ~ user                 = "cms-staging" -> "obduk-cms-staging" # forces replacement
    }

  # module.aws_iam.aws_iam_user.app will be updated in-place
  ~ resource "aws_iam_user" "app" {
        arn           = "arn:aws:iam::414063456747:user/cms-staging"
        force_destroy = false
        id            = "cms-staging"
      ~ name          = "cms-staging" -> "obduk-cms-staging"
        path          = "/"
        tags          = {
            "environment" = "staging"
            "project"     = "cms"
        }
        unique_id     = "AIDAIRDP23R2AS2PCHP2G"
    }

  # module.aws_iam.aws_iam_user_policy.app_cognito must be replaced
-/+ resource "aws_iam_user_policy" "app_cognito" {
      ~ id     = "cms-staging:cognito" -> (known after apply)
        name   = "cognito"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "cognito-idp:ListUsersInGroup"
                        Effect   = "Allow"
                        Resource = "arn:aws:cognito-idp:eu-west-1:414063456747:userpool/eu-west-1_D1lSlBOF6"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "cms-staging" -> "obduk-cms-staging" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_s3 must be replaced
-/+ resource "aws_iam_user_policy" "app_s3" {
      ~ id     = "cms-staging:s3" -> (known after apply)
        name   = "s3"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "s3:ListBucket"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::obduk-cms-staging"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutObjectAcl",
                            "s3:PutObject",
                            "s3:GetObjectAcl",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::obduk-cms-staging/*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "cms-staging" -> "obduk-cms-staging" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_ses must be replaced
-/+ resource "aws_iam_user_policy" "app_ses" {
      ~ id     = "cms-staging:ses" -> (known after apply)
        name   = "ses"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "ses:SendRawEmail"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "cms-staging" -> "obduk-cms-staging" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_sqs must be replaced
-/+ resource "aws_iam_user_policy" "app_sqs" {
      ~ id     = "cms-staging:sqs" -> (known after apply)
        name   = "sqs"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueUrl",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                            "sqs:ChangeMessageVisibility",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:aws:sqs:eu-west-1:414063456747:cms-staging-mailers",
                          - "arn:aws:sqs:eu-west-1:414063456747:cms-staging-default",
                          + "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-staging-mailers",
                          + "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-staging-default",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "cms-staging" -> "obduk-cms-staging" # forces replacement
    }

  # module.heroku.heroku_app.app will be updated in-place
  ~ resource "heroku_app" "app" {
        acm                   = false
        all_config_vars       = (sensitive value)
        buildpacks            = [
            "heroku/nodejs",
            "heroku/ruby",
        ]
        config_vars           = {}
        git_url               = "https://git.heroku.com/obduk-cms-staging.git"
        heroku_hostname       = "obduk-cms-staging.herokuapp.com"
        id                    = "obduk-cms-staging"
        internal_routing      = false
        name                  = "obduk-cms-staging"
        region                = "eu"
      ~ sensitive_config_vars = (sensitive value)
        stack                 = "heroku-18"
        uuid                  = "a2207255-bca4-4f27-ad91-1abe7ba781b6"
        web_url               = "https://obduk-cms-staging.herokuapp.com/"
    }

Plan: 5 to add, 4 to change, 5 to destroy.
```
